import React, { Component } from 'react';

const Header = () => (
		<nav className="navbar navbar-light bg-light">
				<div className="container">
						<a className="navbar-brand" href="#">Navbar</a>
						<form className="form-inline">
								<input className="form-control mr-sm-2" type="search" placeholder="Search" aria-label="Search"/>
								<button className="btn btn-outline-success my-2 my-sm-0" type="submit">Search</button>
						</form>
				</div>
		</nav>
);

const Footer = () => (
		<footer className="footer">
				<div className="container">
						<span className="text-muted"><strong>2018</strong> Place sticky footer content here.</span>
				</div>
		</footer>
);

const Layout = (props) => {
		const { children } = props;
		return (
				<div>
						<Header/>
						{children}
						<Footer/>
				</div>
		);
};

const Page1 = (props) => (
		<div className="container">
				<div className="mt-3">
						<h1>
								Звідки він походить?
						</h1>
				</div>
				<p className="lead">На відміну від поширеної думки Lorem Ipsum не є випадковим набором літер. Він походить з
						уривку класичної латинської літератури 45 року до н.е., тобто має більш як 2000-річну історію. Річард
						Макклінток, професор латини з коледжу Хемпдін-Сидні, що у Вірджінії, вивчав одне з найменш зрозумілих
						латинських слів - consectetur - з уривку Lorem Ipsum, і у пошуку цього слова в класичній літературі
						знайшов безсумнівне джерело. Lorem Ipsum походить з розділів 1.10.32 та 1.10.33 цицеронівського "de
						Finibus Bonorum et Malorum" ("Про межі добра і зла"), написаного у 45 році до н.е. Цей трактат з теорії
						етики був дуже популярним в епоху Відродження. Перший рядок Lorem Ipsum, "Lorem ipsum dolor sit amet..."
						походить з одного з рядків розділу 1.10.32.

						Класичний текст, використовуваний з XVI сторіччя, наведено нижче для всіх зацікавлених. Також точно за
						оригіналом наведено розділи 1.10.32 та 1.10.33 цицеронівського "de Finibus Bonorum et Malorum" разом із
						перекладом англійською, виконаним 1914 року Х.Рекемом.</p>
				<p><a href="../..">Back to</a> Існує багато варіацій уривків з Lorem Ipsum, але більшість з них
						зазнала певних змін на кшталт жартівливих вставок або змішування слів, які навіть не виглядають
						правдоподібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині
						тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem
						Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова
						відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує
						словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum,
						який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів,
						нехарактерних для латини слів і т.ін..</p>
				<p><a href="../..">Back to</a> Існує багато варіацій уривків з Lorem Ipsum, але більшість з них
						зазнала певних змін на кшталт жартівливих вставок або змішування слів, які навіть не виглядають
						правдоподібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині
						тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem
						Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова
						відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує
						словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum,
						який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів,
						нехарактерних для латини слів і т.ін..</p>
				<p><a href="../..">Back to</a> Існує багато варіацій уривків з Lorem Ipsum, але більшість з них
						зазнала певних змін на кшталт жартівливих вставок або змішування слів, які навіть не виглядають
						правдоподібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині
						тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem
						Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова
						відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує
						словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum,
						який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів,
						нехарактерних для латини слів і т.ін..</p>
		</div>
);

class App extends Component {
		render() {
				return (
						<div>
								<Layout>
										<Page1 />
								</Layout>
						</div>
				);
		}
}

		export default App;
